{
  "What is Budget?": "A budget is simply a plan for your money that helps you control where it goes. Think of it as a roadmap for your finances. When you create a budget, you can see exactly how much money comes in and how much goes out, which helps you avoid overspending and start saving.\n\nThe basic rule is simple: Income minus Expenses equals Savings. For example, if you earn ₹50,000 per month and spend ₹35,000, you can save ₹15,000. To get started, just track everything you spend for one week. Write it down in a notebook or use your phone - you'll be surprised where your money actually goes.",
  
  "Track Your Money": "Tracking your money is like having a mirror for your spending habits. Most people have no idea where their money disappears each month. When you start writing down every expense, you'll discover money leaks you never noticed before.\n\nYou don't need fancy apps or complicated systems. Just pick one simple method that works for you - write in a notebook daily, use your phone's notes, check bank statements weekly, or take photos of receipts. Track everything for 30 days and you'll be amazed at what you learn. Don't worry if you forget sometimes - just start again the next day. The goal is progress, not perfection.",
  
  "Profit vs Revenue": "Many people confuse revenue with profit, but they're completely different. Revenue is all the money coming into your business - like if you sell ₹1,00,000 worth of products. Profit is what you actually keep after paying all your costs - so if those products cost you ₹70,000 to make and sell, your profit is only ₹30,000.\n\nThis is why some businesses can have huge sales but still struggle financially. High revenue means nothing if your expenses are equally high. The secret to making more money isn't always selling more - sometimes it's smarter to control your costs better. Every rupee you save on expenses goes straight to your profit.",
  
  "Emergency Fund": "An emergency fund is your financial safety net for life's unexpected moments - job loss, medical bills, home repairs, or family emergencies. It's money you set aside that you never touch unless something truly unexpected happens.\n\nStart small with just ₹10,000 if that's all you can manage. Your long-term goal should be saving 3 to 6 months of your expenses. Keep this money somewhere safe and easily accessible like a savings account or fixed deposit - don't invest it in risky places because you might need it quickly. Even if you can only save ₹500 per month, start now. Remember, this money is only for real emergencies, not for shopping or vacations.",
  
  "Business Expenses": "Business expenses are all the costs you pay to keep your business running. Understanding them is crucial because lower expenses mean higher profits - every rupee you save goes directly to your bottom line.\n\nThere are three types: Fixed expenses stay the same every month like rent and salaries. Variable expenses change monthly like materials and electricity bills. One-time expenses are things you buy occasionally like equipment or furniture. Track common categories like office supplies, transportation, marketing, utilities, and insurance. The most important tip is to keep all your receipts - you'll need them for taxes and to understand exactly where your money goes.",
  
  "Cash Flow Basics": "Cash flow is simply money coming in minus money going out. It sounds simple, but it's the lifeblood of any business. You can be profitable on paper but still go bankrupt if you run out of cash to pay bills.\n\nPositive cash flow means more money comes in than goes out - that's good. Negative cash flow means more goes out than comes in - that's dangerous. To improve cash flow, try getting paid faster by customers, paying bills on time but not early, keeping some cash reserves for emergencies, and monitoring your cash position daily. Remember, cash is king in business.",
  
  "Save Money Tips": "Saving money doesn't have to be painful if you follow simple strategies. The 50-30-20 rule is a great starting point: spend 50% of your income on needs like rent and food, 30% on wants like entertainment, and save 20% for your future and debt payments.\n\nQuick ways to save include cooking at home more often, comparing prices before buying anything, using coupons and cashback offers, waiting 24 hours before making impulse purchases, and reviewing your subscriptions monthly to cancel what you don't use. Remember, saving ₹100 per day adds up to ₹36,500 per year. Small consistent saves create big results over time.",
  
  "Debt Management": "Not all debt is bad - good debt like home loans and business loans can help build wealth, while bad debt like credit cards and personal loans just cost you money. If you have multiple debts, focus your strategy: list all debts, pay minimum amounts on everything, then put any extra money toward the debt with the highest interest rate.\n\nIf you're struggling, stop taking on new debt immediately. Try negotiating lower interest rates with your lenders - many will work with you if you ask. Consider debt consolidation only if it truly lowers your overall interest rate. Remember, becoming debt-free equals financial freedom because you'll have more money for savings and goals instead of interest payments.",
  
  "Investment Basics": "Investing helps your money grow faster than inflation and builds long-term wealth. Start simple with safe options like fixed deposits, then gradually move to mutual funds which offer better returns with moderate risk. You can begin with just ₹500 per month through a SIP (Systematic Investment Plan).\n\nFollow four golden rules: start early even with small amounts, invest regularly every month, don't panic and sell when markets temporarily fall, and diversify by not putting all your money in one place. The most important factor in investing success isn't how much you start with - it's how early you start. Time is your best friend in investing.",
  
  "Tax Planning": "Tax planning helps you save money legally, avoid penalties, improve cash flow, and sleep better at night. For business owners, four things matter most: keep all receipts because no receipt means no tax deduction, track all business expenses properly, file returns on time to avoid penalties, and pay advance tax if your income is high.\n\nCommon business deductions include office rent, equipment and software, business travel expenses, and professional fees for lawyers or accountants. The secret to maximizing tax savings is good record keeping. If you can't prove an expense with proper receipts and documentation, you can't claim it as a deduction."
}